EventBridgeLite/TestudoTakeoff/app/controllers/api/v1/testudos_controller.rb

SELECT "testudos".* FROM "testudos" WHERE "testudos"."buildingName" = ?  [["buildingName", "Toll"]]
---
            def show
                testudos = Testudo.where(buildingName: params[:id].capitalize)

SELECT "testudos".* FROM "testudos"
---
            def isTestHere
                building = params[:id].capitalize
                currentbuilding = Testudo.find {|x| x.buildingName == building}
                currentRegion = currentbuilding.region
                buldingsRegion = []

                if(!currentbuilding.testudoPresnt)
                    Testudo.all.each do |x|