EventBridgeLite/TestudoTakeoff/app/controllers/api/v1/testudos_controller.rb

            def index

                testudos = Testudo.order('created_at DESC');
---
SELECT "testudos".* FROM "testudos" ORDER BY created_at DESC