EventBridgeLite/Demo_APIs/TestudoTakeoff/app/controllers/api/v1/testudos_controller.rb

            def show
                testudos = Testudo.where(buildingName: params[:id].capitalize)
---
SELECT "testudos".* FROM "testudos" WHERE "testudos"."buildingName" = ?  [["buildingName", "Toll"]]

            def isTestHere
                building = params[:id].capitalize
                currentbuilding = Testudo.find {|x| x.buildingName == building}
                currentRegion = currentbuilding.region
                buldingsRegion = []

                if(!currentbuilding.testudoPresnt)
                    Testudo.all.each do |x|
---
SELECT "testudos".* FROM "testudos"